---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctType
source: html/2a1d96af-7d6d-7585-1ed2-2a39c1e7e3f2.htm
---
# Autodesk.Revit.DB.Mechanical.DuctType

A duct type element.

## Syntax (C#)
```csharp
public class DuctType : MEPCurveType
```